tutorials/laminarCounterFlowFlame-2D/1stepReactionMech/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    oxidizer
    {
        type            fixedValue;
        value           uniform 0.162;
    }

    outlet
    {
        type            zeroGradient;
/*        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
*/
    }

    axis
    {
        type            empty;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

}


// ************************************************************************* //
