tutorials/laminarCounterFlowFlame-2D/1stepReactionMech/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 2000;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 300;
    }
    oxidizer
    {
        type            fixedValue;
        value           uniform 1000;
    }

    outlet
    {
//        type            zeroGradient;
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    axis
    {
        type            empty;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

}


// ************************************************************************* //
